#+TITLE:     Using ledger for accounting in org with babel
#+AUTHOR:    Eric S Fraga
#+EMAIL:     e.fraga@ucl.ac.uk
#+DATE:      2010.08.25 20:41:52
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 

#+STARTUP: oddonly

***** An overall balance summary
      :PROPERTIES:
      :ID:       b9747939-6380-495d-9520-aad8e4bf80ad
      :END:

      The overall balance of your account and expenditure with a breakdown
      according to category is specified by passing the =bal= argument
      to /ledger/.

#+begin_src ledger :cmdline bal :results value 
!include /tmp/account.ledger
#+end_src

#+results:
:            £2653.53  assets
:             £650.00  expenses
:           £-3303.53  income

If you want a more detailed breakdown of where your money is and where
it has been spent, you can specify the =-s= flag to tell /ledger/ to
include sub-accounts in the report.

#+begin_src ledger :cmdline -s bal :results value 
!include /tmp/account.ledger
#+end_src

#+results:
#+begin_example
           £2653.53  assets:bank
           £1100.00    chequing
           £1553.53    savings
            £650.00  expenses
            £150.00    food
            £500.00    rent
          £-3303.53  income
             £-3.53    interest
          £-2000.00    salary
          £-1300.00    starting balances
#+end_example


***** Generating a monthly register
      :PROPERTIES:
      :ID:       d9a89c50-33fd-42cc-a6ed-adcf263422d8
      :END:

      You can also generate a monthly register by executing the
      following =src= block.  This presents a summary of transactions
      for each monthly period with a running total in the final column
      (which should be 0 at the end if all the entries are correct).

#+begin_src ledger :cmdline -M reg
!include /tmp/account.ledger
#+end_src

#+results:
#+begin_example
2010/01/01 - 2010/01/31         assets:bank:savings       £1300.00    £1300.00
                                in:starting balances     £-1300.00            0
2010/07/01 - 2010/07/31         assets:bank:chequing       £100.00     £100.00
                                assets:bank:savings        £253.53     £353.53
                                expenses:food              £150.00     £503.53
                                expenses:rent              £500.00    £1003.53
                                income:interest             £-3.53    £1000.00
                                income:salary            £-1000.00            0
2010/08/01 - 2010/08/01         assets:bank:chequing      £1000.00    £1000.00
                                income:salary            £-1000.00            0
#+end_example

We could also generate a monthly report on our =assets= showing how
these are increasing (or decreasing!).  In this case, the final column
will be the running total of the =assets= in our ledger.

#+begin_src ledger :cmdline -M reg assets
!include /tmp/account.ledger
#+end_src

#+results:
: 2010/01/01 - 2010/01/31         assets:bank:savings       £1300.00    £1300.00
: 2010/07/01 - 2010/07/31         assets:bank:chequing       £100.00    £1400.00
:                                 assets:bank:savings        £253.53    £1653.53
: 2010/08/01 - 2010/08/01         assets:bank:chequing      £1000.00    £2653.53

